{
    "data": {
        "count": 15,
        "jobs": [
            {
                "apply_resource_time": 1662170456654,
                "cancel_signal": false,
                "cancel_time": null,
                "cores": 4,
                "create_date": "2022-09-02 02:00:54",
                "create_time": 1662170454772,
                "description": "",
                "dsl": {
                    "components": {
                        "data_transform_0": {
                            "input": {
                                "data": {
                                    "data": [
                                        "reader_0.data"
                                    ]
                                }
                            },
                            "module": "DataTransform",
                            "output": {
                                "data": [
                                    "data"
                                ],
                                "model": [
                                    "model"
                                ]
                            }
                        },
                        "evaluation_0": {
                            "input": {
                                "data": {
                                    "data": [
                                        "hetero_nn_0.data"
                                    ]
                                }
                            },
                            "module": "Evaluation"
                        },
                        "hetero_nn_0": {
                            "input": {
                                "data": {
                                    "train_data": [
                                        "intersection_0.data"
                                    ]
                                }
                            },
                            "module": "HeteroNN",
                            "output": {
                                "data": [
                                    "data"
                                ],
                                "model": [
                                    "model"
                                ]
                            }
                        },
                        "hetero_nn_1": {
                            "input": {
                                "data": {
                                    "test_data": [
                                        "intersection_0.data"
                                    ]
                                },
                                "model": [
                                    "hetero_nn_0.model"
                                ]
                            },
                            "module": "HeteroNN",
                            "output": {
                                "data": [
                                    "data"
                                ],
                                "model": [
                                    "model"
                                ]
                            }
                        },
                        "intersection_0": {
                            "input": {
                                "data": {
                                    "data": [
                                        "data_transform_0.data"
                                    ]
                                }
                            },
                            "module": "Intersection",
                            "output": {
                                "data": [
                                    "data"
                                ]
                            }
                        },
                        "reader_0": {
                            "module": "Reader",
                            "output": {
                                "data": [
                                    "data"
                                ]
                            }
                        }
                    }
                },
                "elapsed": 15252447,
                "end_date": "2022-09-02 06:15:09",
                "end_scheduling_updates": 1,
                "end_time": 1662185709195,
                "engine_name": "EGGROLL",
                "engine_type": "computing",
                "inheritance_info": {},
                "inheritance_status": "pass",
                "initiator_party_id": "9999",
                "initiator_role": "guest",
                "is_initiator": true,
                "job_id": "202209030200543852780",
                "memory": 0,
                "name": "",
                "partners": [
                    10000
                ],
                "party_id": 9999,
                "progress": 100,
                "ready_signal": false,
                "ready_time": null,
                "remaining_cores": 4,
                "remaining_memory": 0,
                "rerun_signal": false,
                "resource_in_use": false,
                "return_resource_time": 1662185709204,
                "role": "guest",
                "roles": {
                    "guest": [
                        9999
                    ],
                    "host": [
                        10000
                    ]
                },
                "runtime_conf": {
                    "component_parameters": {
                        "common": {
                            "hetero_nn_0": {
                                "batch_size": -1,
                                "bottom_nn_define": {
                                    "backend": "tensorflow",
                                    "class_name": "Sequential",
                                    "config": {
                                        "layers": [
                                            {
                                                "class_name": "Dense",
                                                "config": {
                                                    "activation": "relu",
                                                    "activity_regularizer": null,
                                                    "batch_input_shape": [
                                                        null,
                                                        10
                                                    ],
                                                    "bias_constraint": null,
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {
                                                            "dtype": "float32"
                                                        }
                                                    },
                                                    "bias_regularizer": null,
                                                    "dtype": "float32",
                                                    "kernel_constraint": null,
                                                    "kernel_initializer": {
                                                        "class_name": "Constant",
                                                        "config": {
                                                            "dtype": "float32",
                                                            "value": 1
                                                        }
                                                    },
                                                    "kernel_regularizer": null,
                                                    "name": "dense",
                                                    "trainable": true,
                                                    "units": 3,
                                                    "use_bias": true
                                                }
                                            }
                                        ],
                                        "name": "sequential"
                                    },
                                    "keras_version": "2.2.4-tf"
                                },
                                "config_type": "keras",
                                "early_stop": "diff",
                                "epochs": 100,
                                "interactive_layer_define": {
                                    "backend": "tensorflow",
                                    "class_name": "Sequential",
                                    "config": {
                                        "layers": [
                                            {
                                                "class_name": "Dense",
                                                "config": {
                                                    "activation": "linear",
                                                    "activity_regularizer": null,
                                                    "batch_input_shape": [
                                                        null,
                                                        2
                                                    ],
                                                    "bias_constraint": null,
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {
                                                            "dtype": "float32"
                                                        }
                                                    },
                                                    "bias_regularizer": null,
                                                    "dtype": "float32",
                                                    "kernel_constraint": null,
                                                    "kernel_initializer": {
                                                        "class_name": "Constant",
                                                        "config": {
                                                            "dtype": "float32",
                                                            "value": 1
                                                        }
                                                    },
                                                    "kernel_regularizer": null,
                                                    "name": "dense_1",
                                                    "trainable": true,
                                                    "units": 2,
                                                    "use_bias": true
                                                }
                                            }
                                        ],
                                        "name": "sequential_1"
                                    },
                                    "keras_version": "2.2.4-tf"
                                },
                                "interactive_layer_lr": 0.15,
                                "loss": "binary_crossentropy",
                                "optimizer": {
                                    "decay": 0.0,
                                    "learning_rate": 0.15,
                                    "momentum": 0.0,
                                    "nesterov": false,
                                    "optimizer": "SGD"
                                },
                                "top_nn_define": {
                                    "backend": "tensorflow",
                                    "class_name": "Sequential",
                                    "config": {
                                        "layers": [
                                            {
                                                "class_name": "Dense",
                                                "config": {
                                                    "activation": "sigmoid",
                                                    "activity_regularizer": null,
                                                    "batch_input_shape": [
                                                        null,
                                                        2
                                                    ],
                                                    "bias_constraint": null,
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {
                                                            "dtype": "float32"
                                                        }
                                                    },
                                                    "bias_regularizer": null,
                                                    "dtype": "float32",
                                                    "kernel_constraint": null,
                                                    "kernel_initializer": {
                                                        "class_name": "Constant",
                                                        "config": {
                                                            "dtype": "float32",
                                                            "value": 1
                                                        }
                                                    },
                                                    "kernel_regularizer": null,
                                                    "name": "dense_2",
                                                    "trainable": true,
                                                    "units": 1,
                                                    "use_bias": true
                                                }
                                            }
                                        ],
                                        "name": "sequential_2"
                                    },
                                    "keras_version": "2.2.4-tf"
                                }
                            },
                            "hetero_nn_1": {
                                "bottom_nn_define": null,
                                "config_type": "keras",
                                "interactive_layer_define": null,
                                "optimizer": null,
                                "top_nn_define": null
                            }
                        },
                        "role": {
                            "guest": {
                                "0": {
                                    "data_transform_0": {
                                        "with_label": true
                                    },
                                    "reader_0": {
                                        "table": {
                                            "name": "breast_hetero_guest",
                                            "namespace": "experiment"
                                        }
                                    }
                                }
                            },
                            "host": {
                                "0": {
                                    "data_transform_0": {
                                        "with_label": false
                                    },
                                    "reader_0": {
                                        "table": {
                                            "name": "breast_hetero_host",
                                            "namespace": "experiment"
                                        }
                                    }
                                }
                            }
                        }
                    },
                    "conf_path": "test_hetero_nn_binary_conf.json",
                    "dsl_path": "test_hetero_nn_dsl.json",
                    "dsl_version": 2,
                    "initiator": {
                        "party_id": 9999,
                        "role": "guest"
                    },
                    "job_parameters": {
                        "common": {
                            "adaptation_parameters": {
                                "if_initiator_baseline": true,
                                "request_task_cores": 4,
                                "task_cores_per_node": 4,
                                "task_memory_per_node": 0,
                                "task_nodes": 1
                            },
                            "auto_retries": 0,
                            "auto_retry_delay": 1,
                            "computing_engine": "EGGROLL",
                            "computing_partitions": 4,
                            "eggroll_run": {},
                            "engines_address": {},
                            "federated_mode": "MULTIPLE",
                            "federated_status_collect_type": "PUSH",
                            "inheritance_info": {},
                            "job_type": "train",
                            "model_id": "guest-9999#host-10000#model",
                            "model_version": "202209030200543852780",
                            "pulsar_run": {},
                            "rabbitmq_run": {},
                            "spark_run": {},
                            "task_parallelism": 1
                        }
                    },
                    "role": {
                        "guest": [
                            9999
                        ],
                        "host": [
                            10000
                        ]
                    }
                },
                "runtime_conf_on_party": {
                    "component_parameters": {
                        "common": {
                            "hetero_nn_0": {
                                "batch_size": -1,
                                "bottom_nn_define": {
                                    "backend": "tensorflow",
                                    "class_name": "Sequential",
                                    "config": {
                                        "layers": [
                                            {
                                                "class_name": "Dense",
                                                "config": {
                                                    "activation": "relu",
                                                    "activity_regularizer": null,
                                                    "batch_input_shape": [
                                                        null,
                                                        10
                                                    ],
                                                    "bias_constraint": null,
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {
                                                            "dtype": "float32"
                                                        }
                                                    },
                                                    "bias_regularizer": null,
                                                    "dtype": "float32",
                                                    "kernel_constraint": null,
                                                    "kernel_initializer": {
                                                        "class_name": "Constant",
                                                        "config": {
                                                            "dtype": "float32",
                                                            "value": 1
                                                        }
                                                    },
                                                    "kernel_regularizer": null,
                                                    "name": "dense",
                                                    "trainable": true,
                                                    "units": 3,
                                                    "use_bias": true
                                                }
                                            }
                                        ],
                                        "name": "sequential"
                                    },
                                    "keras_version": "2.2.4-tf"
                                },
                                "config_type": "keras",
                                "early_stop": "diff",
                                "epochs": 100,
                                "interactive_layer_define": {
                                    "backend": "tensorflow",
                                    "class_name": "Sequential",
                                    "config": {
                                        "layers": [
                                            {
                                                "class_name": "Dense",
                                                "config": {
                                                    "activation": "linear",
                                                    "activity_regularizer": null,
                                                    "batch_input_shape": [
                                                        null,
                                                        2
                                                    ],
                                                    "bias_constraint": null,
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {
                                                            "dtype": "float32"
                                                        }
                                                    },
                                                    "bias_regularizer": null,
                                                    "dtype": "float32",
                                                    "kernel_constraint": null,
                                                    "kernel_initializer": {
                                                        "class_name": "Constant",
                                                        "config": {
                                                            "dtype": "float32",
                                                            "value": 1
                                                        }
                                                    },
                                                    "kernel_regularizer": null,
                                                    "name": "dense_1",
                                                    "trainable": true,
                                                    "units": 2,
                                                    "use_bias": true
                                                }
                                            }
                                        ],
                                        "name": "sequential_1"
                                    },
                                    "keras_version": "2.2.4-tf"
                                },
                                "interactive_layer_lr": 0.15,
                                "loss": "binary_crossentropy",
                                "optimizer": {
                                    "decay": 0.0,
                                    "learning_rate": 0.15,
                                    "momentum": 0.0,
                                    "nesterov": false,
                                    "optimizer": "SGD"
                                },
                                "top_nn_define": {
                                    "backend": "tensorflow",
                                    "class_name": "Sequential",
                                    "config": {
                                        "layers": [
                                            {
                                                "class_name": "Dense",
                                                "config": {
                                                    "activation": "sigmoid",
                                                    "activity_regularizer": null,
                                                    "batch_input_shape": [
                                                        null,
                                                        2
                                                    ],
                                                    "bias_constraint": null,
                                                    "bias_initializer": {
                                                        "class_name": "Zeros",
                                                        "config": {
                                                            "dtype": "float32"
                                                        }
                                                    },
                                                    "bias_regularizer": null,
                                                    "dtype": "float32",
                                                    "kernel_constraint": null,
                                                    "kernel_initializer": {
                                                        "class_name": "Constant",
                                                        "config": {
                                                            "dtype": "float32",
                                                            "value": 1
                                                        }
                                                    },
                                                    "kernel_regularizer": null,
                                                    "name": "dense_2",
                                                    "trainable": true,
                                                    "units": 1,
                                                    "use_bias": true
                                                }
                                            }
                                        ],
                                        "name": "sequential_2"
                                    },
                                    "keras_version": "2.2.4-tf"
                                }
                            },
                            "hetero_nn_1": {
                                "bottom_nn_define": null,
                                "config_type": "keras",
                                "interactive_layer_define": null,
                                "optimizer": null,
                                "top_nn_define": null
                            }
                        },
                        "role": {
                            "guest": {
                                "0": {
                                    "data_transform_0": {
                                        "with_label": true
                                    },
                                    "reader_0": {
                                        "table": {
                                            "name": "breast_hetero_guest",
                                            "namespace": "experiment"
                                        }
                                    }
                                }
                            },
                            "host": {
                                "0": {
                                    "data_transform_0": {
                                        "with_label": false
                                    },
                                    "reader_0": {
                                        "table": {
                                            "name": "breast_hetero_host",
                                            "namespace": "experiment"
                                        }
                                    }
                                }
                            }
                        }
                    },
                    "conf_path": "test_hetero_nn_binary_conf.json",
                    "dsl_path": "test_hetero_nn_dsl.json",
                    "dsl_version": 2,
                    "initiator": {
                        "party_id": 9999,
                        "role": "guest"
                    },
                    "job_parameters": {
                        "adaptation_parameters": {
                            "if_initiator_baseline": false,
                            "request_task_cores": 4,
                            "task_cores_per_node": 4,
                            "task_memory_per_node": 0,
                            "task_nodes": 1
                        },
                        "auto_retries": 0,
                        "auto_retry_delay": 1,
                        "computing_engine": "EGGROLL",
                        "computing_partitions": 4,
                        "eggroll_run": {
                            "eggroll.session.processors.per.node": 4
                        },
                        "engines_address": {
                            "computing": {
                                "cores_per_node": 16,
                                "nodes": 1
                            },
                            "federation": {
                                "host": "rollsite",
                                "port": 9370
                            },
                            "storage": {
                                "cores_per_node": 16,
                                "nodes": 1
                            }
                        },
                        "federated_mode": "MULTIPLE",
                        "federated_status_collect_type": "PUSH",
                        "federation_engine": "EGGROLL",
                        "inheritance_info": {},
                        "job_type": "train",
                        "model_id": "guest-9999#host-10000#model",
                        "model_version": "202209030200543852780",
                        "pulsar_run": {},
                        "rabbitmq_run": {},
                        "spark_run": {},
                        "storage_engine": "EGGROLL",
                        "task_parallelism": 1
                    },
                    "role": {
                        "guest": [
                            9999
                        ],
                        "host": [
                            10000
                        ]
                    }
                },
                "start_date": "2022-09-02 02:00:56",
                "start_time": 1662170456748,
                "status": "success",
                "status_code": null,
                "tag": "job_end",
                "train_runtime_conf": {},
                "update_date": "2022-09-02 06:15:09",
                "update_time": 1662185709412,
                "user": {
                    "guest": {
                        "9999": ""
                    },
                    "host": {
                        "10000": ""
                    }
                },
                "user_id": ""
            }
        ]
    },
    "retcode": 0,
    "retmsg": "success"
}
