{
    "data": [
        {
            "f_apply_resource_time": 1662167660697,
            "f_cancel_signal": false,
            "f_cancel_time": null,
            "f_cores": 4,
            "f_create_date": "2022-09-02 01:14:18",
            "f_create_time": 1662167658878,
            "f_description": "",
            "f_elapsed": 670791,
            "f_end_date": "2022-09-02 01:25:31",
            "f_end_scheduling_updates": 1,
            "f_end_time": 1662168331584,
            "f_engine_name": "EGGROLL",
            "f_engine_type": "computing",
            "f_inheritance_info": {},
            "f_inheritance_status": "pass",
            "f_initiator_party_id": "9999",
            "f_initiator_role": "guest",
            "f_is_initiator": true,
            "f_job_id": "202209030114165761010",
            "f_memory": 0,
            "f_name": "",
            "f_party_id": "9999",
            "f_progress": 100,
            "f_ready_signal": false,
            "f_ready_time": null,
            "f_remaining_cores": 4,
            "f_remaining_memory": 0,
            "f_rerun_signal": false,
            "f_resource_in_use": false,
            "f_return_resource_time": 1662168331594,
            "f_role": "guest",
            "f_roles": {
                "guest": [
                    9999
                ],
                "host": [
                    10000
                ]
            },
            "f_runtime_conf_on_party": {
                "component_parameters": {
                    "common": {
                        "hetero_nn_0": {
                            "batch_size": -1,
                            "bottom_nn_define": {
                                "backend": "tensorflow",
                                "class_name": "Sequential",
                                "config": {
                                    "layers": [
                                        {
                                            "class_name": "Dense",
                                            "config": {
                                                "activation": "relu",
                                                "activity_regularizer": null,
                                                "batch_input_shape": [
                                                    null,
                                                    10
                                                ],
                                                "bias_constraint": null,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {
                                                        "dtype": "float32"
                                                    }
                                                },
                                                "bias_regularizer": null,
                                                "dtype": "float32",
                                                "kernel_constraint": null,
                                                "kernel_initializer": {
                                                    "class_name": "Constant",
                                                    "config": {
                                                        "dtype": "float32",
                                                        "value": 1
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "name": "dense",
                                                "trainable": true,
                                                "units": 3,
                                                "use_bias": true
                                            }
                                        }
                                    ],
                                    "name": "sequential"
                                },
                                "keras_version": "2.2.4-tf"
                            },
                            "config_type": "keras",
                            "early_stop": "diff",
                            "epochs": 100,
                            "interactive_layer_define": {
                                "backend": "tensorflow",
                                "class_name": "Sequential",
                                "config": {
                                    "layers": [
                                        {
                                            "class_name": "Dense",
                                            "config": {
                                                "activation": "linear",
                                                "activity_regularizer": null,
                                                "batch_input_shape": [
                                                    null,
                                                    2
                                                ],
                                                "bias_constraint": null,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {
                                                        "dtype": "float32"
                                                    }
                                                },
                                                "bias_regularizer": null,
                                                "dtype": "float32",
                                                "kernel_constraint": null,
                                                "kernel_initializer": {
                                                    "class_name": "Constant",
                                                    "config": {
                                                        "dtype": "float32",
                                                        "value": 1
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "name": "dense_1",
                                                "trainable": true,
                                                "units": 2,
                                                "use_bias": true
                                            }
                                        }
                                    ],
                                    "name": "sequential_1"
                                },
                                "keras_version": "2.2.4-tf"
                            },
                            "interactive_layer_lr": 0.15,
                            "loss": "binary_crossentropy",
                            "optimizer": {
                                "decay": 0.0,
                                "learning_rate": 0.15,
                                "momentum": 0.0,
                                "nesterov": false,
                                "optimizer": "SGD"
                            },
                            "top_nn_define": {
                                "backend": "tensorflow",
                                "class_name": "Sequential",
                                "config": {
                                    "layers": [
                                        {
                                            "class_name": "Dense",
                                            "config": {
                                                "activation": "sigmoid",
                                                "activity_regularizer": null,
                                                "batch_input_shape": [
                                                    null,
                                                    2
                                                ],
                                                "bias_constraint": null,
                                                "bias_initializer": {
                                                    "class_name": "Zeros",
                                                    "config": {
                                                        "dtype": "float32"
                                                    }
                                                },
                                                "bias_regularizer": null,
                                                "dtype": "float32",
                                                "kernel_constraint": null,
                                                "kernel_initializer": {
                                                    "class_name": "Constant",
                                                    "config": {
                                                        "dtype": "float32",
                                                        "value": 1
                                                    }
                                                },
                                                "kernel_regularizer": null,
                                                "name": "dense_2",
                                                "trainable": true,
                                                "units": 1,
                                                "use_bias": true
                                            }
                                        }
                                    ],
                                    "name": "sequential_2"
                                },
                                "keras_version": "2.2.4-tf"
                            }
                        },
                        "hetero_nn_1": {
                            "bottom_nn_define": null,
                            "config_type": "keras",
                            "interactive_layer_define": null,
                            "optimizer": null,
                            "top_nn_define": null
                        }
                    },
                    "role": {
                        "guest": {
                            "0": {
                                "data_transform_0": {
                                    "with_label": true
                                },
                                "reader_0": {
                                    "table": {
                                        "name": "breast_hetero_guest",
                                        "namespace": "experiment"
                                    }
                                }
                            }
                        },
                        "host": {
                            "0": {
                                "data_transform_0": {
                                    "with_label": false
                                },
                                "reader_0": {
                                    "table": {
                                        "name": "breast_hetero_host",
                                        "namespace": "experiment"
                                    }
                                }
                            }
                        }
                    }
                },
                "conf_path": "test_hetero_nn_binary_conf.json",
                "dsl_path": "test_hetero_nn_dsl.json",
                "dsl_version": 2,
                "initiator": {
                    "party_id": 9999,
                    "role": "guest"
                },
                "job_parameters": {
                    "adaptation_parameters": {
                        "if_initiator_baseline": false,
                        "request_task_cores": 4,
                        "task_cores_per_node": 4,
                        "task_memory_per_node": 0,
                        "task_nodes": 1
                    },
                    "auto_retries": 0,
                    "auto_retry_delay": 1,
                    "computing_engine": "EGGROLL",
                    "computing_partitions": 4,
                    "eggroll_run": {
                        "eggroll.session.processors.per.node": 4
                    },
                    "engines_address": {
                        "computing": {
                            "cores_per_node": 16,
                            "nodes": 1
                        },
                        "federation": {
                            "host": "rollsite",
                            "port": 9370
                        },
                        "storage": {
                            "cores_per_node": 16,
                            "nodes": 1
                        }
                    },
                    "federated_mode": "MULTIPLE",
                    "federated_status_collect_type": "PUSH",
                    "federation_engine": "EGGROLL",
                    "inheritance_info": {},
                    "job_type": "train",
                    "model_id": "guest-9999#host-10000#model",
                    "model_version": "202209030114165761010",
                    "pulsar_run": {},
                    "rabbitmq_run": {},
                    "spark_run": {},
                    "storage_engine": "EGGROLL",
                    "task_parallelism": 1
                },
                "role": {
                    "guest": [
                        9999
                    ],
                    "host": [
                        10000
                    ]
                }
            },
            "f_start_date": "2022-09-02 01:14:20",
            "f_start_time": 1662167660793,
            "f_status": "success",
            "f_status_code": null,
            "f_tag": "job_end",
            "f_train_runtime_conf": {},
            "f_update_date": "2022-09-02 01:25:31",
            "f_update_time": 1662168331799,
            "f_user": {
                "guest": {
                    "9999": ""
                },
                "host": {
                    "10000": ""
                }
            },
            "f_user_id": ""
        }
    ],
    "retcode": 0,
    "retmsg": "success"
}
